{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "metadata": {
        "author": "Microsoft - support@microsoft.com",
        "comments": "Solution template for Azure Active Directory Identity Protection"
    },
    "parameters": {
        "location": {
            "type": "string",
            "minLength": 1,
            "defaultValue": "[resourceGroup().location]",
            "metadata": {
                "description": "Not used, but needed to pass arm-ttk test `Location-Should-Not-Be-Hardcoded`.  We instead use the `workspace-location` which is derived from the LA workspace"
            }
        },
        "workspace-location": {
            "type": "string",
            "defaultValue": "",
            "metadata": {
                "description": "[concat('Region to deploy solution resources -- separate from location selection',parameters('location'))]"
            }
        },
        "workspace": {
            "defaultValue": "",
            "type": "string",
            "metadata": {
                "description": "Workspace name for Log Analytics where Microsoft Sentinel is setup"
            }
        }
    },
    "variables": {
        "solutionId": "azuresentinel.azure-sentinel-solution-azureactivedirectoryip",
        "_solutionId": "[variables('solutionId')]",
        "email": "support@microsoft.com",
        "_email": "[variables('email')]",
        "workspaceResourceId": "[resourceId('microsoft.OperationalInsights/Workspaces', parameters('workspace'))]",
        "uiConfigId1": "AzureActiveDirectoryIdentityProtection",
        "_uiConfigId1": "[variables('uiConfigId1')]",
        "dataConnectorContentId1": "AzureActiveDirectoryIdentityProtection",
        "_dataConnectorContentId1": "[variables('dataConnectorContentId1')]",
        "dataConnectorId1": "[extensionResourceId(resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace')), 'Microsoft.SecurityInsights/dataConnectors', variables('_dataConnectorContentId1'))]",
        "_dataConnectorId1": "[variables('dataConnectorId1')]",
        "dataConnectorTemplateSpecName1": "[concat(parameters('workspace'),'-dc-',uniquestring(variables('_dataConnectorContentId1')))]",
        "dataConnectorVersion1": "1.0.0",
        "analyticRuleVersion1": "1.0.6",
        "analyticRulecontentId1": "a3df4a32-4805-4c6d-8699-f3c888af2f67",
        "_analyticRulecontentId1": "[variables('analyticRulecontentId1')]",
        "analyticRuleId1": "[resourceId('Microsoft.SecurityInsights/AlertRuleTemplates', variables('analyticRulecontentId1'))]",
        "analyticRuleTemplateSpecName1": "[concat(parameters('workspace'),'-ar-',uniquestring(variables('_analyticRulecontentId1')))]",
        "Confirm-AADRiskyUser-alert-trigger": "Confirm-AADRiskyUser-alert-trigger",
        "_Confirm-AADRiskyUser-alert-trigger": "[variables('Confirm-AADRiskyUser-alert-trigger')]",
        "playbookVersion1": "1.0",
        "playbookContentId1": "Confirm-AADRiskyUser-alert-trigger",
        "_playbookContentId1": "[variables('playbookContentId1')]",
        "playbookId1": "[resourceId('Microsoft.Logic/workflows', variables('playbookContentId1'))]",
        "playbookTemplateSpecName1": "[concat(parameters('workspace'),'-pl-',uniquestring(variables('_playbookContentId1')))]",
        "blanks": "[replace('b', 'b', '')]",
        "Confirm-AADRiskyUser-incident-trigger": "Confirm-AADRiskyUser-incident-trigger",
        "_Confirm-AADRiskyUser-incident-trigger": "[variables('Confirm-AADRiskyUser-incident-trigger')]",
        "playbookVersion2": "1.0",
        "playbookContentId2": "Confirm-AADRiskyUser-incident-trigger",
        "_playbookContentId2": "[variables('playbookContentId2')]",
        "playbookId2": "[resourceId('Microsoft.Logic/workflows', variables('playbookContentId2'))]",
        "playbookTemplateSpecName2": "[concat(parameters('workspace'),'-pl-',uniquestring(variables('_playbookContentId2')))]",
        "Dismiss-AADRisky-Useralert-trigger": "Dismiss-AADRisky-Useralert-trigger",
        "_Dismiss-AADRisky-Useralert-trigger": "[variables('Dismiss-AADRisky-Useralert-trigger')]",
        "playbookVersion3": "1.0",
        "playbookContentId3": "Dismiss-AADRisky-Useralert-trigger",
        "_playbookContentId3": "[variables('playbookContentId3')]",
        "playbookId3": "[resourceId('Microsoft.Logic/workflows', variables('playbookContentId3'))]",
        "playbookTemplateSpecName3": "[concat(parameters('workspace'),'-pl-',uniquestring(variables('_playbookContentId3')))]",
        "Dismiss-AADRisky-Userincident-trigger": "Dismiss-AADRisky-Userincident-trigger",
        "_Dismiss-AADRisky-Userincident-trigger": "[variables('Dismiss-AADRisky-Userincident-trigger')]",
        "playbookVersion4": "1.0",
        "playbookContentId4": "Dismiss-AADRisky-Userincident-trigger",
        "_playbookContentId4": "[variables('playbookContentId4')]",
        "playbookId4": "[resourceId('Microsoft.Logic/workflows', variables('playbookContentId4'))]",
        "playbookTemplateSpecName4": "[concat(parameters('workspace'),'-pl-',uniquestring(variables('_playbookContentId4')))]",
        "IdentityProtection-TeamsBotResponse": "IdentityProtection-TeamsBotResponse",
        "_IdentityProtection-TeamsBotResponse": "[variables('IdentityProtection-TeamsBotResponse')]",
        "playbookVersion5": "1.0",
        "playbookContentId5": "IdentityProtection-TeamsBotResponse",
        "_playbookContentId5": "[variables('playbookContentId5')]",
        "playbookId5": "[resourceId('Microsoft.Logic/workflows', variables('playbookContentId5'))]",
        "playbookTemplateSpecName5": "[concat(parameters('workspace'),'-pl-',uniquestring(variables('_playbookContentId5')))]"
    },
    "resources": [
        {
            "name": "pid-6f17c37f-8548-4bfa-aac3-b3c203b65586-partnercenter",
            "type": "Microsoft.Resources/deployments",
            "apiVersion": "2020-10-01",
            "properties": {
                "mode": "Incremental",
                "template": {
                    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
                    "contentVersion": "1.0.0.0",
                    "resources": []
                }
            }
        },
        {
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',variables('_dataConnectorContentId1'))]",
            "apiVersion": "2021-03-01-preview",
            "type": "Microsoft.OperationalInsights/workspaces/providers/dataConnectors",
            "location": "[parameters('workspace-location')]",
            "kind": "StaticUI",
            "properties": {
                "connectorUiConfig": {
                    "title": "Azure Active Directory Identity Protection",
                    "publisher": "Microsoft",
                    "descriptionMarkdown": "Azure Active Directory Identity Protection provides a consolidated view at risk users, risk events and vulnerabilities, with the ability to remediate risk immediately, and set policies to auto-remediate future events. The service is built on Microsoft’s experience protecting consumer identities and gains tremendous accuracy from the signal from over 13 billion logins a day. Integrate Microsoft Azure Active Directory Identity Protection alerts with Microsoft Sentinel to view dashboards, create custom alerts, and improve investigation. For more information, see the [Microsoft Sentinel documentation ](https://go.microsoft.com/fwlink/p/?linkid=2220065&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).\n\n[Get Azure Active Directory Premium P1/P2 ](https://aka.ms/asi-ipcconnectorgetlink)",
                    "graphQueries": [
                        {
                            "metricName": "Total data received",
                            "legend": "SecurityAlerts (IPC)",
                            "baseQuery": "SecurityAlert | where ProductName == \"Azure Active Directory Identity Protection\""
                        }
                    ],
                    "dataTypes": [
                        {
                            "name": "SecurityAlert (IPC)",
                            "lastDataReceivedQuery": "SecurityAlert | where ProductName == \"Azure Active Directory Identity Protection\"\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
                        }
                    ],
                    "connectivityCriterias": [
                        {
                            "type": "SentinelKinds",
                            "value": [
                                "AzureActiveDirectory"
                            ]
                        }
                    ],
                    "id": "[variables('_uiConfigId1')]"
                }
            }
        },
        {
            "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
            "apiVersion": "2022-01-01-preview",
            "location": "[parameters('workspace-location')]",
            "properties": {
                "version": "2.0.7",
                "kind": "Solution",
                "contentSchemaVersion": "2.0.0",
                "contentId": "[variables('_solutionId')]",
                "parentId": "[variables('_solutionId')]",
                "source": {
                    "kind": "Solution",
                    "name": "Azure Active Directory Identity Protection",
                    "sourceId": "[variables('_solutionId')]"
                },
                "author": {
                    "name": "Microsoft",
                    "email": "[variables('_email')]"
                },
                "support": {
                    "name": "Microsoft Corporation",
                    "email": "support@microsoft.com",
                    "tier": "Microsoft",
                    "link": "https://support.microsoft.com/"
                },
                "dependencies": {
                    "operator": "AND",
                    "criteria": [
                        {
                            "kind": "DataConnector",
                            "contentId": "[variables('_dataConnectorContentId1')]",
                            "version": "[variables('dataConnectorVersion1')]"
                        }
                    ]
                },
                "firstPublishDate": "2022-05-18",
                "providers": [
                    "Microsoft"
                ],
                "categories": {
                    "domains": [
                        "Security - Threat Protection",
                        "Security - Automation (SOAR)"
                    ]
                }
            },
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/', variables('_solutionId'))]"
        }
    ],
    "outputs": {}
}
